import { DisplayMainIndication } from "../Display";


export default function MainIndicator({
    offsetX = 0,
    offsetY = 0,
    data,
    scale = 1,

    color1 = "#72bdff",
    color2 = "#22384b"
}: {
    offsetX?: number,
    offsetY?: number,
    data: DisplayMainIndication,
    scale?: number,

    color1?: string,
    color2?: string

}) {

    const segmentSymbols: Record<string, string[]> = {
        "1": ["0", "2", "3", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "T", "А", "Б", "В", "Г", "Е", "Ё", "З", "О", "П", "Р", "С", "Т", "Ф", "Э", "Я", "%", "&"],
        "2": ["0", "2", "3", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "S", "T", "Z", "А", "Б", "В", "Г", "Д", "Е", "Ё", "З", "Й", "О", "П", "Р", "С", "Т", "Ф", "Э", "Я", "%", "&"],
        "4": ["0", "2", "3", "5", "6", "7", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "S", "T", "Z", "А", "Б", "В", "Г", "Д", "Е", "Ё", "З", "Й", "О", "П", "Р", "С", "Т", "Ф", "Я", "&"],
        "3": ["0", "2", "3", "5", "6", "8", "9", "A", "B", "C", "D", "E", "F", "G", "I", "O", "P", "Q", "R", "S", "T", "А", "Б", "В", "Г", "Е", "Ё", "О", "П", "Р", "С", "Т", "Ф", "Я", "&"],

        "5": ["2", "3", "4", "5", "6", "8", "9", "A", "E", "F", "H", "K", "P", "R", "Y", "А", "Б", "Д", "Е", "Ё", "К", "Н", "Р", "Ф", "Ч", "Ы", "Ь", "Э", "Ю", "Я", "+", "-", "&"],
        "7": ["2", "3", "4", "5", "6", "8", "9", "A", "E", "F", "H", "K", "P", "R", "Y", "А", "Б", "Д", "Е", "Ё", "К", "Н", "Р", "Ф", "Ч", "Ы", "Ь", "Э", "Ю", "Я", "+", "-", "&"],
        "6": ["2", "3", "4", "5", "6", "8", "9", "A", "B", "E", "F", "G", "H", "P", "R", "S", "Y", "А", "Б", "В", "Д", "Е", "Ё", "З", "Н", "Р", "Ф", "Ч", "Ъ", "Э", "Я", "+", "-"],
        "8": ["2", "3", "4", "5", "6", "8", "9", "A", "B", "E", "F", "G", "H", "P", "R", "S", "Y", "А", "Б", "В", "Д", "Е", "Ё", "З", "Н", "Р", "Ф", "Ч", "Ъ", "Я", "+", "-"],

        "9": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "U", "Y", "Б", "В", "Е", "Ё", "З", "О", "С", "Ц", "Ш", "Щ", "Э", "_", "&"],
        "10": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "S", "U", "Z", "Y", "Б", "В", "Е", "Ё", "З", "О", "С", "Ц", "Ш", "Щ", "Э", "_", "&"],
        "12": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "S", "U", "Z", "Y", "Б", "В", "Е", "Ё", "З", "О", "С", "Ц", "Ш", "Щ", "_", "%", "&"],
        "11": ["0", "2", "3", "5", "6", "8", "9", "B", "C", "D", "E", "G", "I", "J", "L", "O", "Q", "S", "U", "Y", "Б", "В", "Е", "Ё", "З", "О", "С", "Ц", "Ш", "Щ", "_", "%", "&"],

        "13": ["0", "4", "5", "6", "8", "9", "A", "C", "E", "F", "G", "H", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "Y", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Ь", "Ю", "Я", "%"],
        "14": ["0", "4", "5", "6", "8", "9", "A", "C", "E", "F", "G", "H", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "Y", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Ь", "Ю", "Я", "%"],
        "15": ["0", "4", "5", "6", "8", "9", "A", "C", "E", "F", "G", "H", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "Y", "А", "Б", "Г", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ф", "Ц", "Ч", "Ш", "Щ", "Ы", "Ь", "Ю", "Я", "%"],

        "17": ["B", "D", "I", "T", "В", "Ж", "Т", "Ф", "Ц", "Ш", "Щ", "Ъ", "!", "|", "*"],
        "18": ["B", "D", "I", "T", "В", "Ж", "Т", "Ф", "Ц", "Ш", "Щ", "Ъ", "+", "!", "|", "*"],
        "16": ["B", "D", "I", "T", "В", "Ж", "Т", "Ф", "Ц", "Ш", "Щ", "Ъ", "+", "!", "|", "*"],

        "26": ["B", "D", "I", "T", "В", "Ж", "Т", "Ф", "Ц", "Ш", "Щ", "Ъ", "+", "|", "*"],
        "27": ["B", "D", "I", "T", "В", "Ж", "Т", "Ф", "Ц", "Ш", "Щ", "Ъ", "+", "|", "*"],
        "25": ["B", "D", "I", "T", "В", "Ж", "Т", "Ф", "Ц", "Ш", "Щ", "Ъ", "!", "|", "*"],

        "19": ["0", "1", "2", "3", "4", "8", "9", "A", "B", "D", "H", "J", "M", "N", "O", "P", "Q", "R", "U", "W", "Y", "А", "В", "И", "Й", "Л", "М", "Н", "О", "П", "Р", "Ф", "Ч", "Ш", "Щ", "Ы", "Ю", "Я"],
        "20": ["0", "1", "2", "3", "4", "8", "9", "A", "B", "D", "H", "J", "M", "N", "O", "P", "Q", "R", "U", "W", "Y", "А", "В", "И", "Й", "Л", "М", "Н", "О", "П", "Р", "Ф", "Ч", "Ш", "Щ", "Ы", "Ю", "Я"],
        "21": ["0", "1", "2", "3", "4", "8", "9", "A", "B", "D", "H", "J", "M", "N", "O", "P", "Q", "R", "U", "W", "Y", "А", "В", "И", "Й", "Л", "М", "Н", "О", "П", "Р", "Ф", "Ч", "Ш", "Щ", "Ы", "Ю", "Я"],

        "22": ["0", "2", "6", "8", "A", "C", "E", "F", "G", "H", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "А", "Б", "Г", "Д", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ц", "Ш", "Щ", "Ы", "Ь", "Ю", "&"],
        "23": ["0", "2", "6", "8", "A", "C", "E", "F", "G", "H", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "А", "Б", "Г", "Д", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ц", "Ш", "Щ", "Ы", "Ь", "Ю", "&"],
        "24": ["0", "2", "6", "8", "A", "C", "E", "F", "G", "H", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "U", "V", "W", "А", "Б", "Г", "Д", "Е", "Ё", "И", "Й", "К", "М", "Н", "О", "П", "Р", "С", "Ц", "Ш", "Щ", "Ы", "Ь", "Ю", "&"],

        "28": ["0", "1", "3", "4", "5", "6", "8", "9", "A", "B", "D", "G", "H", "J", "M", "N", "O", "Q", "S", "U", "W", "Y", "А", "Б", "В", "Д", "З", "И", "Й", "Л", "М", "Н", "О", "П", "Ч", "Ш", "Щ", "Ы", "Ю", "Я", "%", "&"],
        "29": ["0", "1", "3", "4", "5", "6", "8", "9", "A", "B", "D", "G", "H", "J", "M", "N", "O", "Q", "S", "U", "W", "Y", "А", "Б", "В", "Д", "З", "И", "Й", "Л", "М", "Н", "О", "П", "Ч", "Ш", "Щ", "Ы", "Ю", "Я", "%", "&"],
        "30": ["0", "1", "3", "4", "5", "6", "8", "9", "A", "B", "D", "G", "H", "J", "M", "N", "O", "Q", "S", "U", "W", "Y", "А", "Б", "В", "Д", "З", "И", "Й", "Л", "М", "Н", "О", "П", "Ч", "Ш", "Щ", "Ы", "Ю", "Я", "%", "&"],


        "31": ["M", "N", "S", "X", "Д", "Ж", "М", "У", "Х", "Ъ", "\\", ":", ";", "%", "&", "*", "`"],
        "32": ["Ъ", "%"],
        "33": ["Ъ", "%"],
        "34": ["M", "N", "S", "X", "Д", "Ж", "М", "У", "Х", "\\", "&", "*", "`"],
        "35": ["M", "N", "S", "X", "Д", "Ж", "М", "У", "Х", "\\", "&", "*", "`"],

        "36": ["1", "7", "K", "M", "V", "X", "Z", "Д", "Ж", "З", "И", "Й", "К", "Л", "М", "У", "Х", "Э", "Ю", "/", "%", "&", "*", "'"],
        "37": ["1", "7", "K", "M", "V", "X", "Z", "Д", "Ж", "З", "И", "Й", "К", "Л", "М", "У", "Х", "Ю", "/", "%", "&", "*", "'"],
        "38": ["1", "7", "K", "M", "V", "X", "Z", "Д", "Ж", "З", "И", "Й", "К", "Л", "М", "У", "Х", "Ю", "/", "%", "&", "*", "'"],
        "39": ["Э"],
        "40": ["Э"],

        "41": ["7", "V", "W", "X", "Z", "Ж", "И", "Й", "Л", "У", "Х", "Ы", "Ь", "Я", "/", ":", ";", ".", ",", "%", "*"],
        "42": ["7", "V", "W", "X", "Z", "Ж", "И", "Й", "Л", "У", "Х", "Ы", "Ь", "Я", "/", ";", ",", "%", "*"],
        "43": ["7", "V", "W", "X", "Z", "Ж", "И", "Й", "Л", "У", "Х", "Ы", "Ь", "Я", "/", ";", ".", ",", "%", "*"],

        "46": ["K", "N", "Q", "R", "W", "X", "Ж", "К", "Х", "Щ", "Ъ", "Э", "Ю", "\\", "%", "&", "*"],
        "47": ["Ъ", "Э", "%"],
        "48": ["Ъ", "Э", "%"],
        "49": ["K", "N", "Q", "R", "W", "X", "Ж", "К", "Х", "Щ", "Ю", "\\", "&", "*"],
        "50": ["K", "N", "Q", "R", "W", "X", "Ж", "К", "Х", "Щ", "Ю", "\\", "&", "*"],
    };

    const fillForSegment = (id: number): string => {
        if (Array.isArray(data)) return data.some(symbol => segmentSymbols[id]?.includes(symbol?.toUpperCase() || "")) ? color1 : color2;
        if (data satisfies DisplayMainIndication && typeof data !== 'string' && data.directDisplay) return data.segments.includes(id) ? color1 : color2;
        if (typeof data === 'string') return (segmentSymbols[id]?.includes(data.toUpperCase())) ? color1 : color2;
        
        return color2;
        // return (segmentSymbols[id]) ? "" : '#22384b';
    }

    return (
        <g /*fill="#72bdff"*/ stroke="none" strokeLinecap="butt" transform={`translate(${offsetX} ${offsetY}) scale(${scale})`}>

            {/* Top 4 horizontal segments */}
            <path fill={fillForSegment(1)} d="M348.62641,293.46626h2.53014v2.17752h-5.06194v-1.0818z" strokeWidth="NaN" />
            <path fill={fillForSegment(2)} d="M356.864,293.46626v2.17752h-5.06194v-2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(3)} d="M368.2789,294.56198v1.0818h-5.06194v-2.17752h2.53014z" strokeWidth="NaN" />
            <path fill={fillForSegment(4)} d="M362.57145,293.46626v2.17752h-5.06194v-2.17752z" strokeWidth="NaN" />

            {/* Middle 4 horizontal segments */}
            <path fill={fillForSegment(5)} d="M346.14996,314.89916v-2.17752h5.06194v2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(6)} d="M357.56485,314.89916v-2.17752h5.06194v2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(7)} d="M351.85741,314.89916v-2.17752h5.06194v2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(8)} d="M363.27231,314.89916v-2.17752h5.06194v2.17752z" strokeWidth="NaN" />

            {/* Bottom 4 horizontal segments */}
            <path fill={fillForSegment(9)} d="M346.14996,333.02623v-1.0818h5.06194v2.17752h-2.53014z" strokeWidth="NaN" />
            <path fill={fillForSegment(10)} d="M351.85741,334.12195v-2.17752h5.06194v2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(11)} d="M365.80245,334.12195h-2.53014v-2.17752h5.06194v1.0818z" strokeWidth="NaN" />
            <path fill={fillForSegment(12)} d="M357.56486,334.12195v-2.17752h5.06194v2.17752z" strokeWidth="NaN" />



            {/* Top-Left 3 vertical segments */}
            <path fill={fillForSegment(13)} d="M348.27214,312.1325h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(14)} d="M348.27214,301.23712h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(15)} d="M348.27214,306.68481h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />

            {/* Top-Middle 3 vertical segments */}
            <path fill={fillForSegment(16)} d="M358.33086,312.09199h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(17)} d="M358.33086,301.19661h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(18)} d="M358.33086,306.6443h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />

            {/* Top-Right 3 vertical segments */}
            <path fill={fillForSegment(19)} d="M368.28762,312.1325h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(20)} d="M368.28762,301.23712h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(21)} d="M368.28762,306.68481h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />


            {/* Bottom-Left 3 vertical segments */}
            <path fill={fillForSegment(22)} d="M348.27214,331.29626h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(23)} d="M348.27214,320.40088h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(24)} d="M348.27214,325.84857h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />

            {/* Bottom-Middle 3 vertical segments */}
            <path fill={fillForSegment(25)} d="M358.33086,331.25575h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(26)} d="M358.33086,320.36037h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(27)} d="M358.33086,325.80806h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />

            {/* Bottom-Right 3 vertical segments */}
            <path fill={fillForSegment(28)} d="M368.28762,331.29626h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(29)} d="M368.28762,320.40088h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />
            <path fill={fillForSegment(30)} d="M368.28762,325.84857h-2.17752v-4.83156h2.17752z" strokeWidth="NaN" />


            {/* Additional 5-segment indicators */}

            {/* Top-Left */}
            <path fill={fillForSegment(31)} d="M352.28569,306.57673l-1.10113,-2.40614l1.10139,-2.42542l1.07613,2.42542z" strokeWidth="NaN" />
            <path fill={fillForSegment(32)} d="M353.47457,303.67965l-0.93823,-1.80116l1.12098,-5.92881l1.34659,2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(33)} d="M351.04055,304.52503l0.99569,2.03105l-1.17845,5.69892l-1.34659,-2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(34)} d="M349.51121,298.13402l1.34659,-2.18434l1.12098,5.92881l-0.93823,1.80116z" strokeWidth="NaN" />
            <path fill={fillForSegment(35)} d="M355.00391,310.07066l-1.34659,2.18434l-1.17845,-5.69892l0.99569,-2.03105z" strokeWidth="NaN" />

            {/* Top-Right */}
            <path fill={fillForSegment(36)} d="M362.33423,306.57673l-1.10113,-2.40614l1.10139,-2.42542l1.07613,2.42542z" strokeWidth="NaN" />
            <path fill={fillForSegment(37)} d="M363.52311,303.67965l-0.93823,-1.80116l1.12098,-5.92881l1.34659,2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(38)} d="M361.08909,304.52503l0.99569,2.03105l-1.17845,5.69892l-1.34659,-2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(39)} d="M359.55975,298.13402l1.34659,-2.18434l1.12098,5.92881l-0.93823,1.80116z" strokeWidth="NaN" />
            <path fill={fillForSegment(40)} d="M365.05245,310.07066l-1.34659,2.18434l-1.17845,-5.69892l0.99569,-2.03105z" strokeWidth="NaN" />

            {/* Bottom-Left */}
            <path fill={fillForSegment(41)} d="M352.28569,325.94566l-1.10113,-2.40614l1.10139,-2.42542l1.07613,2.42542z" strokeWidth="NaN" />
            <path fill={fillForSegment(42)} d="M353.47457,323.04858l-0.93823,-1.80116l1.12098,-5.92881l1.34659,2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(43)} d="M351.04055,323.89396l0.99569,2.03105l-1.17845,5.69892l-1.34659,-2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(44)} d="M349.51121,317.50295l1.34659,-2.18434l1.12098,5.92881l-0.93823,1.80116z" strokeWidth="NaN" />
            <path fill={fillForSegment(45)} d="M355.00391,329.43959l-1.34659,2.18434l-1.17845,-5.69892l0.99569,-2.03105z" strokeWidth="NaN" />

            {/* Bottom-Right */}
            <path fill={fillForSegment(46)} d="M362.33423,325.94566l-1.10113,-2.40614l1.10139,-2.42542l1.07613,2.42542z" strokeWidth="NaN" />
            <path fill={fillForSegment(47)} d="M363.52311,323.04858l-0.93823,-1.80116l1.12098,-5.92881l1.34659,2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(48)} d="M361.08909,323.89396l0.99569,2.03105l-1.17845,5.69892l-1.34659,-2.18434z" strokeWidth="NaN" />
            <path fill={fillForSegment(49)} d="M359.55975,317.50295l1.34659,-2.18434l1.12098,5.92881l-0.93823,1.80116z" strokeWidth="NaN" />
            <path fill={fillForSegment(50)} d="M365.05245,329.43959l-1.34659,2.18434l-1.17845,-5.69892l0.99569,-2.03105z" strokeWidth="NaN" />


        </g>
    )
}